{
    "clean_transcript": "Doctor: Good morning, Alex. I'm Dr. Nedo, one of the cardiologists here at City Heart Clinic. Have a seat. So, your primary care doctor referred you — tell me what's been going on.\n\nPatient: Hi, doctor. Yeah, so about two weeks ago I started feeling these... I don't know how to describe it... like my heart skips a beat? Or sometimes it feels like it's doing an extra beat. It's this weird fluttering in my chest.\n\nDoctor: Okay. And when you say two weeks, was there a specific moment it started, or did it come on gradually?\n\nPatient: It kind of came on gradually. I noticed it first when I was lying in bed at night, trying to fall asleep. Then I started noticing it during the day too, especially when I'm sitting at my desk at work.\n\nDoctor: How often would you say it happens? A few times a day, a few times an hour?\n\nPatient: Some days it's just a few times. Other days, like yesterday, it felt like it was happening every few minutes. That's when I got worried and called my doctor.\n\nDoctor: I understand. And when it happens, does it last just a second — like a single skip — or does it go on for longer stretches?\n\nPatient: Usually just a single skip. Once or twice I felt like there were two or three in a row, but that only lasted a couple of seconds.\n\nDoctor: Do you get any chest pain with it? Shortness of breath? Dizziness or feeling lightheaded?\n\nPatient: No real chest pain. Sometimes after a strong one I feel a little lightheaded for a second, but it passes right away. No shortness of breath.\n\nDoctor: Have you ever fainted or felt like you were about to faint?\n\nPatient: No, never.\n\nDoctor: Good. Now, has anything changed in your life in the past few weeks? More stress at work? Changes in sleep? Caffeine intake?\n\nPatient: Actually, yeah. Work has been pretty intense lately. We have a big project deadline coming up, so I've been putting in longer hours. Probably more stressed than usual. And I'll be honest, I've been drinking more coffee than I should — maybe four or five cups a day.\n\nDoctor: That's a lot of coffee. Any alcohol?\n\nPatient: Maybe a beer or two on weekends. Nothing crazy.\n\nDoctor: Any energy drinks or supplements?\n\nPatient: No energy drinks. I take a multivitamin, that's it.\n\nDoctor: Okay. Any history of heart problems in your family? Parents, siblings, anyone with heart disease at a young age?\n\nPatient: My dad had high blood pressure, but he's managing it with medication. No heart attacks or anything like that in the family that I know of.\n\nDoctor: And you personally — any medical history? High blood pressure, diabetes, thyroid issues, anything?\n\nPatient: No, I've been pretty healthy. No medications, no surgeries. Last physical was about a year ago and everything was fine.\n\nDoctor: Do you exercise?\n\nPatient: I try to. I used to run three or four times a week, but with the work stress I've been slacking. Maybe once a week now.\n\nDoctor: Alright. Let me examine you and then we'll do some tests. Let me check your blood pressure first.\n\nDoctor: Your blood pressure is 140 over 90. That's a bit elevated. Could be the stress, could be the coffee, or it could be something we need to keep an eye on. Let me listen to your heart now.\n\nDoctor: I can hear a few of those extra beats right now, actually. Your heart rhythm is mostly regular, but there are some premature beats mixed in. I also hear a very faint murmur. Nothing that sounds alarming, but we'll get a better look with the echo.\n\nDoctor: Let's do an EKG first and then the echocardiogram. The EKG will show us the electrical pattern of your heart, and the echo will let us see the structure — the valves, the muscle, how it's pumping.\n\nPatient: Okay. Should I be worried?\n\nDoctor: Based on what I'm seeing so far, I don't think this is anything dangerous. But let's get the full picture before we talk about it. Better to know for sure than to guess.\n\nDoctor: Alright, looking at your EKG. So your basic rhythm is normal — that's good. Normal sinus rhythm, heart rate is 78, all the intervals look fine. But I can see these extra beats here — see these wider complexes? These are called PVCs — premature ventricular contractions. Basically, your heart's lower chambers are firing off an extra beat before they're supposed to.\n\nPatient: Is that serious?\n\nDoctor: In most cases, PVCs by themselves are not dangerous. They're actually very common — most people have them occasionally and never even notice. The question is always: is there something underneath causing them, and how many are you having? That's what we need to figure out.\n\nDoctor: Okay, Alex, good news. Your echo looks very good overall. Your heart muscle is strong — the ejection fraction is 55%, which is normal. The walls are contracting well, no signs of any structural heart disease. There is one small finding — you have mild mitral valve regurgitation. That means one of your heart valves leaks back a tiny amount of blood when your heart pumps.\n\nPatient: That sounds bad.\n\nDoctor: I know it sounds concerning, but mild mitral regurgitation is extremely common. Many people have trace or mild regurgitation and never have any issues from it. At this level, it doesn't need treatment. We'll just monitor it over time.\n\nDoctor: So let me put the whole picture together for you. You're a 41-year-old guy, no significant medical history, under increased stress at work, drinking quite a bit of coffee. You're having palpitations that are caused by PVCs — premature ventricular contractions. Your heart structure looks good on the echo, and the EKG shows a normal underlying rhythm with these extra beats. Your blood pressure is a little elevated at 140 over 90.\n\nDoctor: The good news is that this is a very treatable situation. Here's what I'd like to do.\n\nDoctor: First, I want to start you on a medication called propranolol. It's a beta-blocker — it works by slowing your heart rate down a little and making your heart less reactive to stress hormones like adrenaline. It's very effective for PVCs and it'll also help with that borderline blood pressure. I'm going to prescribe 40 milligrams, twice a day.\n\nPatient: Are there side effects I should know about?\n\nDoctor: Good question. The most common ones are feeling a bit more tired, especially in the first week or so as your body adjusts. Some people feel a little lightheaded when they stand up quickly — that's because it lowers your blood pressure. Cold hands and feet sometimes. If you're exercising, you might notice your heart rate doesn't go as high as usual. But most people tolerate it very well. One important thing — don't stop taking it suddenly. If we decide to stop it, we'll taper it down gradually.\n\nPatient: Okay. Can I still drink coffee?\n\nDoctor: I'd really like you to cut back significantly. Five cups is a lot. Caffeine is a stimulant and it can definitely trigger PVCs. Try to get down to one, maybe two cups a day. And no coffee after noon if you can help it. It'll also help with the stress and sleep.\n\nPatient: Alright, I'll try.\n\nDoctor: Beyond the medication, I also want you to focus on the stress management piece. I know it's easier said than done with a busy job, but stress and sleep deprivation are big triggers for PVCs. Try to get back to your exercise routine — even 30 minutes of walking or light jogging a few times a week will help. Regular sleep schedule. If the stress is really bad, consider talking to someone about it.\n\nDoctor: For follow-up, I want to see you back in two weeks. We'll check your blood pressure again and see how the propranolol is working. If the palpitations have improved and your blood pressure is better, we'll continue the same dose. If not, we may need to adjust.\n\nDoctor: I also want to order a 24-hour Holter monitor. That's a small device you wear on your chest for a full day — it records every heartbeat. That will tell us exactly how many PVCs you're having and whether there are any other rhythm issues we might be missing. We'll schedule that for your next visit.\n\nDoctor: And I'm ordering some blood work — I want to check your thyroid function, potassium levels, and a basic metabolic panel. Thyroid problems and electrolyte imbalances can both cause PVCs, so we want to rule those out. You can get the blood draw done at the lab downstairs today if you have time.\n\nPatient: I can do that. So just to make sure I have this right — I have these PVCs, which are extra heartbeats, my heart itself is structurally fine, the valve thing is minor, and the treatment is the propranolol plus lifestyle changes?\n\nDoctor: That's exactly right. You've got a good understanding. The PVCs are the main issue, and we have a clear plan to address them. Your heart is structurally healthy, and that's the most important thing. We'll get this under control.\n\nPatient: Great. Thank you, doctor. I feel a lot better knowing what's going on.\n\nDoctor: Of course. Any other questions before we wrap up?\n\nPatient: I don't think so. Two weeks, blood work today, cut the coffee, take the propranolol.\n\nDoctor: Perfect. My nurse will get your prescription set up and schedule the follow-up. And if the palpitations suddenly get much worse, or if you feel chest pain, severe dizziness, or shortness of breath — call us right away or go to the ER. Don't wait for the follow-up.\n\nPatient: Got it. Thanks again.\n\nDoctor: Take care, Alex. We'll get this sorted out.",
    "speakers": {
        "doctor": "Dr. Michael Nedo, MD",
        "patient": "Alex Johnson"
    },
    "extracted_entities": {
        "symptoms": [
            "Palpitations (heart skipping\/extra beats, fluttering in chest) — onset 2 weeks ago, gradual, variable frequency",
            "Transient lightheadedness — brief, associated with strong palpitations",
            "Increased work-related stress",
            "Reduced sleep"
        ],
        "diagnoses": [
            "Premature ventricular contractions (PVCs)",
            "Mild mitral valve regurgitation",
            "Elevated blood pressure (140\/90 mmHg)"
        ],
        "medications": [
            {
                "name": "Propranolol",
                "dose": "40 mg",
                "frequency": "Twice daily",
                "route": "Oral",
                "status": "new"
            },
            {
                "name": "Multivitamin",
                "dose": "",
                "frequency": "Daily",
                "route": "Oral",
                "status": "continued"
            }
        ],
        "tests_ordered": [
            "24-hour Holter monitor (to be scheduled at next visit)",
            "Thyroid function tests",
            "Potassium level",
            "Basic metabolic panel (BMP)"
        ],
        "test_results": [
            "12-lead EKG: Normal sinus rhythm, heart rate 78 bpm, normal intervals, premature ventricular contractions (PVCs) with widened complexes",
            "Echocardiogram: Ejection fraction 55% (normal), normal wall motion, no structural heart disease, mild mitral valve regurgitation"
        ],
        "vitals": {
            "blood_pressure": "140\/90 mmHg",
            "heart_rate": "78 bpm (per EKG)"
        },
        "allergies": [],
        "procedures": [
            "12-lead electrocardiogram (EKG)",
            "Transthoracic echocardiogram",
            "Cardiac auscultation"
        ]
    },
    "soap_note": {
        "chief_complaint": "41-year-old male referred by primary care physician for palpitations described as heart skipping and fluttering in the chest, occurring for approximately two weeks with increasing frequency.",
        "history_of_present_illness": "Patient reports a two-week history of palpitations described as the heart skipping a beat or producing extra beats, accompanied by a fluttering sensation in the chest. Onset was gradual, initially noticed while lying in bed at night, and subsequently during the day while sitting at work.\n\nThe frequency is variable — ranging from a few times per day to every few minutes on worse days. Episodes typically consist of a single skip lasting about one second; on one or two occasions, the patient noted two to three consecutive beats lasting a couple of seconds. The patient reports transient lightheadedness following stronger palpitations, resolving immediately. He denies chest pain, shortness of breath, syncope, or pre-syncope.\n\nExacerbating factors:\n- Increased occupational stress with longer working hours and a pending project deadline\n- Elevated caffeine intake (4–5 cups of coffee per day)\n- Reduced exercise frequency (previously running 3–4 times per week, now approximately once per week)\n- Possible sleep deprivation related to stress\n\nSocial history:\n- Alcohol: 1–2 beers on weekends (social use)\n- No energy drinks\n- Takes a daily multivitamin; no other medications or supplements\n- No tobacco use mentioned\n\nPast medical history:\n- No significant medical history\n- No prior surgeries\n- Last physical examination approximately one year ago — reported as normal\n\nFamily history:\n- Father: hypertension, managed with medication\n- No family history of heart attacks, sudden cardiac death, or heart disease at a young age",
        "review_of_systems": "**Cardiovascular:** Palpitations (skipped\/extra beats, fluttering), transient lightheadedness. Denies chest pain, syncope, pre-syncope, and shortness of breath.\n\n**Constitutional:** Increased stress, reduced exercise. No reported fever, weight changes, or fatigue (other than work-related).\n\n**Respiratory:** Denies shortness of breath.\n\n**Neurological:** Brief lightheadedness associated with palpitations; denies sustained dizziness or fainting.\n\n**All other systems:** Not specifically reviewed during this encounter.",
        "physical_exam": "**Vitals:**\n- Blood pressure: 140\/90 mmHg (elevated)\n- Heart rate: 78 bpm (per EKG)\n\n**Cardiac auscultation:**\n- Heart rhythm mostly regular with audible premature beats\n- Very faint murmur noted\n- No other abnormal heart sounds reported\n\n**12-lead EKG findings:**\n- Normal sinus rhythm at 78 bpm\n- Normal intervals (PR, QRS, QT)\n- Premature ventricular contractions (PVCs) present — widened QRS complexes\n\n**Echocardiogram findings:**\n- Left ventricular ejection fraction: 55% (normal)\n- Normal wall motion and contractility\n- No signs of structural heart disease\n- Mild mitral valve regurgitation identified",
        "assessment": "1. **Premature ventricular contractions (PVCs)** — Likely triggered by increased stress, elevated caffeine intake, and possible sleep deprivation. No evidence of underlying structural heart disease on echocardiogram. Normal sinus rhythm with PVCs on EKG.\n\n2. **Elevated blood pressure (140\/90 mmHg)** — Borderline hypertension, possibly related to stress and caffeine intake. Requires monitoring.\n\n3. **Mild mitral valve regurgitation** — Incidental finding on echocardiogram. Clinically insignificant at this level; does not require treatment. Warrants long-term monitoring.",
        "plan": "1. **Start propranolol 40 mg orally twice daily** — Beta-blocker for suppression of PVCs and management of borderline elevated blood pressure. Patient counseled on common side effects (fatigue, orthostatic lightheadedness, cold extremities, blunted exercise heart rate). Instructed not to discontinue abruptly — must be tapered if stopping.\n\n2. **Caffeine reduction** — Reduce intake from 4–5 cups per day to no more than 1–2 cups per day. No coffee after noon. Caffeine is a known PVC trigger.\n\n3. **Lifestyle modifications:**\n   - Resume regular exercise: 30 minutes of walking or light jogging several times per week\n   - Maintain a regular sleep schedule\n   - Stress management; consider counseling or other stress-reduction strategies if needed\n\n4. **Laboratory testing today:**\n   - Thyroid function tests\n   - Potassium level\n   - Basic metabolic panel (BMP)\n   - Purpose: rule out thyroid disease and electrolyte imbalances as contributing causes of PVCs\n\n5. **24-hour Holter monitor** — To be scheduled at the next visit to quantify PVC burden and screen for any other arrhythmias.\n\n6. **Follow-up appointment in 2 weeks:**\n   - Reassess blood pressure\n   - Evaluate response to propranolol\n   - Review lab results\n   - Apply Holter monitor\n   - Adjust medication dosage if palpitations or blood pressure are not adequately controlled\n\n7. **Safety precautions:** Patient instructed to seek immediate medical attention (call office or go to ER) if palpitations worsen significantly, or if he experiences chest pain, severe dizziness, or shortness of breath.",
        "current_medications": "- **Propranolol** 40 mg orally twice daily — NEW (prescribed this visit for PVCs and borderline hypertension)\n- **Multivitamin** — daily — CONTINUED (patient's existing supplement)"
    },
    "unclear_sections": []
}