{
    "clean_transcript": "Doctor: Un instant, ok, donc on a fait le scan coronaire ici et il était fait le 20 janvier, mais je ne vois pas le protocole, attendez un instant. Marie, est-ce que vous êtes toujours essoufflée ?\nPatient: Mais oui, mais oui.\nDoctor: Ok, et qu'est-ce que vous prenez comme médicament actuellement ?\nPatient: Rien pour le cœur, moi je prends Cymbalta, mais maintenant ils sont en train de finir parce qu'ils ne vont plus le produire, je prends L-Thyroxine à 0,50, et puis je prends Toviaz pour l'incontinence urinaire.\nDoctor: Ok, donc ici il parle, comme je vous ai expliqué, de sténose modérée au niveau de l'artère coronaire gauche et l'artère coronaire droite. Quand je regarde ici les clichés, il semble réellement que ces rétrécissements, ce n'est pas quelque chose qui est significatif, donc si je comprends bien, vous ne faites pas de douleur dans la poitrine ?\nPatient: Je sens un poids, par exemple, dimanche, je suis allée marcher dans le parc, il faisait beau, j'étais bien, quand je suis rentrée, j'étais malade, mais je n'avais rien de spécial, à part la fatigue, parce que la fatigue, les derniers mois, est très très grande, mais vraiment grande, la fatigue, ça c'est incroyable.\nDoctor: Bon, alors, est-ce que cet essoufflement, bon, ce poids, cette lourdeur, ça vous arrive après l'effort ?\nPatient: Oui.\nDoctor: Ok, vous ne prenez pas d'Asaflow ? Écoutez, sincèrement, les rétrécissements que je vois ici sont limite, alors c'est très difficile à dire, est-ce que c'est ça qui explique votre essoufflement, parce qu'il peut y avoir un tas d'autres causes, donc moi ce que je propose, c'est qu'on fasse une coronarographie, donc la coronarographie, c'est un examen qui va nous permettre de voir l'état de ces artères, mais aussi évaluer le débit de sang dans cette artère, donc on va faire des tests supplémentaires pour voir si ces plaques sont vraiment limite, ou peut-être qu'ils ont raté quelque chose au scan coronaire. Donc l'examen, ça se déroule comme ça, je vais piquer ici la main au niveau de l'avant-bras, alors après, je vais passer un petit cathéter jusqu'au cœur pour voir quelle est l'anatomie de ces artères, et puis on va placer un petit filament pour mesurer le débit. Et alors, là, je peux vous dire avec certitude ou sans certitude, est-ce que c'est vraiment quelque chose qui est important, ou il y a une autre cause, ok ? Donc je vais vous fixer une date, ce n'est pas urgent, on a un peu d'attente maintenant, donc attendez, je vais voir si je peux vous proposer ça. Par exemple, j'ai une date le mardi 3, est-ce que ça vous va ? 3 mars, ça c'est dans deux semaines.\nPatient: Ok.\nDoctor: Donc mardi 3, vous préférez être ici ou à Saint Mary's ?\nPatient: Non, non, ici.\nDoctor: Ok, ça va. Donc l'examen, il aura lieu au site de Saint Mary's, mais ils vont vous transférer, et puis vous allez retourner ici, ok ? Donc c'est moi qui ferai ça. Vous n'êtes pas diabétique, non ?\nPatient: Non.\nDoctor: Donc il faut être à jeun, de préférence présentez-vous ici vers 7 heures, ok ?\nPatient: Ok. Est-ce que vous avez un bic ? Le mien ne le fait plus.\nDoctor: Attendez, malheureusement le bic ici c'est rare, moi je le perds tout le temps. Non, je n'ai pas, mais je vais vous imprimer tout ça.\nPatient: D'accord, très bien.\nDoctor: Ok, alors qu'est-ce que je voulais dire ? Donc, à jeun, je vais vous prescrire encore des médicaments. Est-ce que vous avez fait une prise de sang récemment, par exemple le niveau de cholestérol ?\nPatient: Oui, il n'est pas si haut qu'auparavant.\nDoctor: Vous prenez quelque chose ? Les résultats, je vais… Vous prenez quelque chose déjà pour le cholestérol ou pas ?\nPatient: Je prenais Arterin et je prends des choses homéopathiques, mais dans ma boîte, il y a les résultats, les derniers résultats de la prise de sang. Mais je ne l'ai pas imprimé, je ne l'ai pas, moi je ne sais pas entrer, je ne suis pas capable.\nDoctor: Je cherche ça.\nPatient: Vous avez besoin de ma carte d'identité ?\nDoctor: Non, non. Voilà, j'ai ici le résultat de prise de sang du 16 juillet 2021, alors votre niveau de cholestérol, LDL, le mauvais cholestérol était à 75 et vous me dites que vous ne prenez rien pour le cholestérol.\nPatient: Non.\nDoctor: Donc en fait le 75, quand on a déjà des plaques au niveau des artères du cœur, il est considéré comme trop haut. Donc je suis quand même dans l'obligation de vous introduire un traitement.\nPatient: Oui.\nDoctor: Donc je vais vous donner deux médicaments en plus, attendez, je vais faire ça. Il est trop haut quand même.\nPatient: Non.\nDoctor: Alors il y aura deux médicaments à prendre, donc un de ces médicaments, il s'appelle Asaflow, ça c'est une petite aspirine et l'autre, il s'appelle Crestor. Donc il faut baisser un peu le niveau de cholestérol et il faut également vous donner une petite aspirine pour protéger contre l'infarctus. Maintenant, ce qui est important, c'est que très rarement on a des effets secondaires avec Crestor. Si vous ressentez des douleurs dans les jambes, des crampes ou des douleurs musculaires, vous arrêtez ce médicament et c'est rare. Donc c'est moins de 5% des patients, donc ne vous inquiétez pas.\nPatient: Des douleurs, j'en ai toujours. \nDoctor: Ah oui.\nPatient: Alors, c'est rare du fait que j'ai des crampes musculaires, moi j'ai la fibromyalgie, donc c'est des douleurs très fréquentes. Par exemple, cette nuit, j'avais très mal au genou, à un genou, et très, très, très mal.\nDoctor: Tout à fait.\nPatient: Moi je prends toujours la [UNCLEAR: cétamone].\nDoctor: Donc ici, ces deux médicaments, la coronarographie est prévue pour le 3 du 3. Et alors vous venez ici à l'accueil à jeun. 3 du 3, mes excuses, 3 du 3. Et est-ce que vous avez des questions ?\nPatient: Pas spécialement, je vais lire ça.\nDoctor: Parfait, donc on se voit alors dans deux semaines le mardi, ok ?\nPatient: Donc, examen, vous dites à 7h, admission, 7h30 ?\nDoctor: Oui, à 7h30 ici, chez nous.\nPatient: Ok. Je lis tout ça.\nDoctor: Ça, vous n'avez pas besoin.\nPatient: Docteur, vous avez encore l'analyse du sang. Vous pourriez me dire pour le fer ?\nDoctor: Oui.\nPatient: Parce que je suis toujours très basse pour le fer, et je n'en sais rien pour le moment. Est-ce qu'elle est très basse ?\nDoctor: Ferritine, etc. Alors, comment est-ce que ça… C'est long ici, donc pour le fer. La ferritine est normale, donc c'est à 58, la normale entre 30 et 400. Donc ici, je ne vois pas une déficience. En plus, vous êtes légèrement anémique, ça c'est vrai.\nPatient: Oui.\nDoctor: Mais ça, je suppose que c'était toujours le cas.\nPatient: Oui, légèrement.\nDoctor: Mais le volume des globules rouges, c'est un paramètre qui parfois nous dit, s'il y a une anémie qui est causée par le fer, c'est plutôt normal. Donc à mon avis, ce n'est pas ça.\nPatient: Ok.\nDoctor: Ok, donc je vais vous imprimer.\nPatient: Oh, c'est très gentil.\nDoctor: Pas de souci. Voilà.\nPatient: Merci.\nDoctor: Ça, c'est pour vous.\nPatient: C'est très gentil.\nDoctor: Est-ce que vous avez encore des questions ?\nPatient: Non, non.\nDoctor: Les médicaments, hein ? La prescription. Je vous ai donné, tout est donné. Je vous ai donné là.\nPatient: Ah, oui. Ça. Ok. Non, non. Plutôt, il y a ça.\nDoctor: Ah. Ok. Pardon.\nPatient: C'est pour ça, je veux dire. Enfin, merci.\nDoctor: Ça, c'est l'ordonnance. En tout cas, elle est connectée avec votre carte d'identité.\nPatient: Oui. Ah oui. Ok. Voilà. Bon, écoutez, d'un autre côté.\nDoctor: Oui, madame.\nPatient: Ma mère est décédée d'une hémorragie cérébrale. Ma sœur est décédée à cinquante-huit ans avec un anévrisme.\nDoctor: Un anévrisme à la…\nPatient: Oui.\nDoctor: Quelle est la question ?\nPatient: Non. S'il y a des choses héréditaires. Donc, j'ai toujours eu la sensation que je devais faire attention à tout ça. Et mes examens, je les fais parce que je les ai demandés parce que je n'étais pas tranquille.\nDoctor: Voilà. En tout cas, je… Ça va ? Ok. Parfait. Mais bon, écoutez, merci beaucoup. C'est tout de mon côté alors. Bonne journée.\nPatient: À vous aussi. Au revoir.",
    "speakers": {
        "doctor": "Dr. Nedo",
        "patient": "Marie"
    },
    "extracted_entities": {
        "symptoms": [
            "Dyspnea \/ shortness of breath (persistent)",
            "Severe fatigue (worsening over recent months)",
            "Chest heaviness \/ weight sensation (exertional)",
            "Feeling unwell after exertion (post-exercise malaise)",
            "Knee pain (nocturnal, severe — reported night before visit)",
            "Chronic muscle cramps",
            "Chronic musculoskeletal pain (fibromyalgia-related)"
        ],
        "diagnoses": [
            "Moderate stenosis of the left coronary artery (coronary CT scan finding — borderline significance)",
            "Moderate stenosis of the right coronary artery (coronary CT scan finding — borderline significance)",
            "Coronary artery plaques",
            "Hypercholesterolemia (LDL 75 mg\/dL — considered elevated given existing coronary plaques)",
            "Mild anemia (chronic, pre-existing)",
            "Fibromyalgia (patient-reported, pre-existing)",
            "Hypothyroidism (pre-existing, on treatment)",
            "Urinary incontinence (pre-existing, on treatment)"
        ],
        "medications": [
            {
                "name": "Cymbalta (duloxetine)",
                "dose": "not specified",
                "frequency": "not specified",
                "route": "oral",
                "status": "discontinued (manufacturer discontinuation)"
            },
            {
                "name": "L-Thyroxine (levothyroxine)",
                "dose": "50 mcg",
                "frequency": "not specified",
                "route": "oral",
                "status": "continued"
            },
            {
                "name": "Toviaz (fesoterodine)",
                "dose": "not specified",
                "frequency": "not specified",
                "route": "oral",
                "status": "continued"
            },
            {
                "name": "Arterin (red yeast rice supplement)",
                "dose": "not specified",
                "frequency": "not specified",
                "route": "oral",
                "status": "discontinued (previously taken for cholesterol)"
            },
            {
                "name": "[UNCLEAR: cétamone] — possibly ketamine or another analgesic",
                "dose": "not specified",
                "frequency": "not specified",
                "route": "not specified",
                "status": "continued (patient-reported, for chronic pain)"
            },
            {
                "name": "Asaflow (low-dose aspirin)",
                "dose": "not specified",
                "frequency": "not specified",
                "route": "oral",
                "status": "new"
            },
            {
                "name": "Crestor (rosuvastatin)",
                "dose": "not specified",
                "frequency": "not specified",
                "route": "oral",
                "status": "new"
            }
        ],
        "tests_ordered": [
            "Coronary angiography with fractional flow reserve (FFR) measurement — scheduled March 3, 2026"
        ],
        "test_results": [
            {
                "test": "Coronary CT scan",
                "date": "2026-01-20",
                "result": "Moderate stenosis of left coronary artery and right coronary artery; assessed by Dr. Nedo as borderline \/ not clearly significant on review of images"
            },
            {
                "test": "Blood work — LDL cholesterol",
                "date": "2021-07-16",
                "result": "LDL 75 mg\/dL (considered elevated given existing coronary plaques)"
            },
            {
                "test": "Blood work — Ferritin",
                "date": "2021-07-16",
                "result": "58 (normal range 30–400); no iron deficiency identified"
            },
            {
                "test": "Blood work — Hemoglobin \/ Anemia markers",
                "date": "2021-07-16",
                "result": "Mildly anemic; MCV (mean corpuscular volume) within normal range, suggesting anemia is not iron-deficiency related"
            }
        ],
        "vitals": [],
        "allergies": [],
        "procedures": [
            "Coronary angiography with catheter-based flow assessment (FFR) — planned March 3, 2026, performed by Dr. Nedo at Saint Mary's site with admission at main site"
        ]
    },
    "soap_note": {
        "chief_complaint": "Follow-up for persistent dyspnea and review of coronary CT scan results showing moderate coronary artery stenosis.",
        "history_of_present_illness": "Marie is a non-diabetic female presenting for review of a coronary CT scan performed on January 20, 2026, which demonstrated moderate stenosis of both the left and right coronary arteries.\n\nShe reports persistent shortness of breath and a sensation of heaviness\/weight in the chest, occurring primarily after physical exertion. For example, after walking in the park on Sunday, she felt unwell upon returning home. She denies typical anginal chest pain.\n\nShe describes severe and worsening fatigue over the past several months, which she emphasizes is very significant.\n\nShe also reports chronic musculoskeletal pain related to fibromyalgia, including frequent muscle cramps and severe nocturnal knee pain (the night before this visit). She previously took a homeopathic supplement for cholesterol (Arterin) but is not on any prescription lipid-lowering therapy.\n\nMedical history:\n- Fibromyalgia with chronic musculoskeletal pain\n- Hypothyroidism (on treatment)\n- Urinary incontinence (on treatment)\n- Mild chronic anemia (pre-existing)\n- Depression\/pain management (on Cymbalta, currently being discontinued due to manufacturer supply issues)\n\nFamily history:\n- Mother: deceased from cerebral hemorrhage\n- Sister: deceased at age 58 from cerebral aneurysm\n\nThe patient expresses concern about hereditary cerebrovascular risk and states she proactively requests investigations because of this family history.",
        "review_of_systems": "- **Constitutional:** Severe, worsening fatigue over recent months\n- **Cardiovascular:** Persistent dyspnea on exertion; sensation of chest heaviness\/weight after physical activity; no typical anginal chest pain reported\n- **Musculoskeletal:** Chronic diffuse musculoskeletal pain (fibromyalgia); frequent muscle cramps; severe nocturnal knee pain (unilateral, night before visit)\n- **Hematologic:** Patient reports a history of low iron levels; mild chronic anemia acknowledged\n- **Neurological\/Psychiatric:** Cymbalta being discontinued (supply issue); no new neurological complaints reported\n- **Genitourinary:** Urinary incontinence (chronic, on treatment)",
        "physical_exam": "No formal physical examination findings were documented during this visit.\n\nThe visit was primarily a consultation to review imaging results and discuss further diagnostic workup. No vitals, auscultation, or palpation findings were recorded in the transcript.",
        "assessment": "1. **Moderate coronary artery stenosis (left and right coronary arteries)** — identified on coronary CT scan (January 20, 2026). On review of the images, the stenoses appear borderline and it is unclear whether they are hemodynamically significant. The relationship between these findings and the patient's exertional dyspnea and chest heaviness remains uncertain; other etiologies must also be considered.\n\n2. **Hypercholesterolemia** — LDL of 75 mg\/dL (July 2021 lab work). In the context of documented coronary artery plaques, this level is considered above target and warrants pharmacological treatment.\n\n3. **Mild chronic anemia** — pre-existing and stable. Ferritin is normal (58; range 30–400) and MCV is within normal limits, suggesting this is not iron-deficiency anemia.\n\n4. **Fibromyalgia** — chronic, with ongoing muscle cramps and joint pain. Noted as a potential confounder for monitoring statin side effects.\n\n5. **Family history of cerebrovascular disease** — mother (cerebral hemorrhage) and sister (fatal cerebral aneurysm at age 58). Patient is concerned about hereditary risk.",
        "plan": "1. **Coronary angiography with flow reserve measurement (FFR)** scheduled for **Tuesday, March 3, 2026**.\n   - Admission at 7:30 AM at the main site; procedure at the Saint Mary's site (transfer arranged); return to main site post-procedure.\n   - Performed by Dr. Nedo.\n   - Patient must be **fasting (NPO)**.\n   - Purpose: definitive evaluation of coronary artery anatomy and hemodynamic significance of the borderline stenoses identified on CT scan.\n\n2. **New prescription — Asaflow (low-dose aspirin):** Initiated for cardioprotection and myocardial infarction prevention given documented coronary plaques. Dose not specified in transcript.\n\n3. **New prescription — Crestor (rosuvastatin):** Initiated for LDL-lowering given coronary artery plaques with LDL of 75 mg\/dL (above target for secondary prevention). Dose not specified in transcript.\n   - Patient counseled on potential side effects: muscle pain, leg cramps, myalgia — occurs in fewer than 5% of patients.\n   - Patient instructed to discontinue Crestor if significant new muscle pain or cramps develop.\n   - **Note:** Patient has pre-existing fibromyalgia with chronic muscle cramps and pain, which may complicate monitoring for statin-related myopathy.\n\n4. **Blood work results reviewed** (July 16, 2021):\n   - LDL cholesterol: 75 mg\/dL — above target for a patient with coronary plaques\n   - Ferritin: 58 (normal range 30–400) — no iron deficiency\n   - Mild anemia present; MCV normal — not consistent with iron-deficiency anemia\n\n5. **Follow-up:** At the time of the coronary angiography appointment (March 3, 2026).",
        "current_medications": "- **Cymbalta (duloxetine)** — dose not specified, oral; STATUS: being discontinued (manufacturer discontinuation\/supply issue)\n- **L-Thyroxine (levothyroxine)** — 50 mcg, oral; STATUS: continued (for hypothyroidism)\n- **Toviaz (fesoterodine)** — dose not specified, oral; STATUS: continued (for urinary incontinence)\n- **[UNCLEAR: cétamone]** — dose not specified; STATUS: continued (patient-reported, for chronic pain\/fibromyalgia)\n- **Homeopathic supplements** — not further specified; STATUS: continued (patient-reported)\n- **Arterin (red yeast rice supplement)** — previously taken for cholesterol; STATUS: discontinued\n- **Asaflow (low-dose aspirin)** — dose not specified, oral; STATUS: NEW (cardioprotection)\n- **Crestor (rosuvastatin)** — dose not specified, oral; STATUS: NEW (LDL-lowering)"
    },
    "unclear_sections": [
        {
            "timestamp_or_context": "Patient states: 'Moi je prends toujours la cétamone'",
            "issue": "Medication name 'cétamone' is unclear — likely a speech-to-text artifact. Could refer to ketamine (used off-label for chronic pain\/fibromyalgia), or another analgesic. The exact medication name, dose, and route could not be confirmed from the transcript.",
            "marker": "[UNCLEAR: cétamone]"
        },
        {
            "timestamp_or_context": "Patient states: 'c'est des douleurs très rares'",
            "issue": "Likely speech-to-text error or misspoken. In context, the patient is describing frequent pain from fibromyalgia, not rare pain. The intended meaning appears to be 'very frequent' (très fréquentes) rather than 'very rare' (très rares).",
            "marker": "[UNCLEAR: rares vs fréquentes]"
        },
        {
            "timestamp_or_context": "Dosages for newly prescribed Asaflow and Crestor",
            "issue": "No specific doses were stated in the transcript for either Asaflow (aspirin) or Crestor (rosuvastatin). The prescription was printed and given to the patient but doses were not verbalized during the visit.",
            "marker": "[UNCLEAR: doses not verbalized]"
        },
        {
            "timestamp_or_context": "Blood work date: July 16, 2021",
            "issue": "The blood work results reviewed are approximately 4.5 years old. It is unclear whether more recent lab work exists; the doctor accessed what was available in the system. No new blood work was explicitly ordered during this visit.",
            "marker": "[NOTE: dated lab results]"
        }
    ]
}